tests/tproxy_benchmark.txt
// running thanos with round robin
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	49.1068 secs
  Slowest:	0.1438 secs
  Fastest:	0.0001 secs
  Average:	0.0049 secs
  Requests/sec:	20363.7864
  
  Total data:	12000000 bytes
  Size/request:	12 bytes

Response time histogram:
  0.000 [1]	|
  0.014 [981432]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.029 [15756]	|■
  0.043 [1516]	|
  0.058 [723]	|
  0.072 [344]	|
  0.086 [100]	|
  0.101 [53]	|
  0.115 [17]	|
  0.129 [27]	|
  0.144 [31]	|


Latency distribution:
  10% in 0.0010 secs
  25% in 0.0023 secs
  50% in 0.0042 secs
  75% in 0.0064 secs
  90% in 0.0090 secs
  95% in 0.0110 secs
  99% in 0.0175 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.1438 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0123 secs
  resp wait:	0.0045 secs, 0.0000 secs, 0.0840 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0789 secs

// running thanos with least connections
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	45.1085 secs
  Slowest:	0.0603 secs
  Fastest:	0.0001 secs
  Average:	0.0045 secs
  Requests/sec:	22168.7491
  
  Total data:	11000000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [782107]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [201381]	|■■■■■■■■■■
  0.018 [12670]	|■
  0.024 [2764]	|
  0.030 [724]	|
  0.036 [218]	|
  0.042 [57]	|
  0.048 [36]	|
  0.054 [40]	|
  0.060 [2]	|


Latency distribution:
  10% in 0.0014 secs
  25% in 0.0027 secs
  50% in 0.0040 secs
  75% in 0.0058 secs
  90% in 0.0079 secs
  95% in 0.0094 secs
  99% in 0.0137 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0603 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0167 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0287 secs
  resp wait:	0.0042 secs, 0.0000 secs, 0.0441 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0291 secs

Status code distribution:
  [200]	1000000 responses