tests/tproxy_benchmark.txt
// running thanos with round robin
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	44.9406 secs
  Slowest:	0.0826 secs
  Fastest:	0.0001 secs
  Average:	0.0045 secs
  Requests/sec:	22251.6100
  
  Total data:	11000000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.008 [916960]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.017 [78104]	|■■■
  0.025 [3889]	|
  0.033 [748]	|
  0.041 [184]	|
  0.050 [56]	|
  0.058 [10]	|
  0.066 [1]	|
  0.074 [24]	|
  0.083 [23]	|


Latency distribution:
  10% in 0.0014 secs
  25% in 0.0026 secs
  50% in 0.0040 secs
  75% in 0.0058 secs
  90% in 0.0079 secs
  95% in 0.0095 secs
  99% in 0.0137 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0826 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0230 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0294 secs
  resp wait:	0.0042 secs, 0.0000 secs, 0.0482 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0454 secs

Status code distribution:
  [200]	1000000 responses

// running thanos with least connections
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	45.1085 secs
  Slowest:	0.0603 secs
  Fastest:	0.0001 secs
  Average:	0.0045 secs
  Requests/sec:	22168.7491
  
  Total data:	11000000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [782107]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [201381]	|■■■■■■■■■■
  0.018 [12670]	|■
  0.024 [2764]	|
  0.030 [724]	|
  0.036 [218]	|
  0.042 [57]	|
  0.048 [36]	|
  0.054 [40]	|
  0.060 [2]	|


Latency distribution:
  10% in 0.0014 secs
  25% in 0.0027 secs
  50% in 0.0040 secs
  75% in 0.0058 secs
  90% in 0.0079 secs
  95% in 0.0094 secs
  99% in 0.0137 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0603 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0167 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0287 secs
  resp wait:	0.0042 secs, 0.0000 secs, 0.0441 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0291 secs

Status code distribution:
  [200]	1000000 responses