tests/tproxy_benchmark.txt
// running 3 node servers
hey -n 100000 -c 100 http://localhost:8080

Summary:
  Total:	4.7303 secs
  Slowest:	0.0411 secs
  Fastest:	0.0001 secs
  Average:	0.0047 secs
  Requests/sec:	21140.0957
  
  Total data:	1100000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [49437]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [40272]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [8769]	|■■■■■■■
  0.016 [1219]	|■
  0.021 [199]	|
  0.025 [38]	|
  0.029 [26]	|
  0.033 [33]	|
  0.037 [5]	|
  0.041 [1]	|


Latency distribution:
  10% in 0.0015 secs
  25% in 0.0028 secs
  50% in 0.0042 secs
  75% in 0.0061 secs
  90% in 0.0083 secs
  95% in 0.0099 secs
  99% in 0.0133 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0411 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0203 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0134 secs
  resp wait:	0.0043 secs, 0.0001 secs, 0.0210 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0120 secs

Status code distribution:
  [200]	100000 responses