tests/tproxy_benchmark.txt
// running 3 node servers
hey -n 100000 -c 100 http://localhost:8080

Summary:
  Total:	6.4225 secs
  Slowest:	0.0957 secs
  Fastest:	0.0001 secs
  Average:	0.0063 secs
  Requests/sec:	15570.3286
  
  Total data:	1100000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.010 [81168]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.019 [17013]	|■■■■■■■■
  0.029 [1494]	|■
  0.038 [193]	|
  0.048 [64]	|
  0.057 [27]	|
  0.067 [22]	|
  0.077 [1]	|
  0.086 [16]	|
  0.096 [1]	|


Latency distribution:
  10% in 0.0014 secs
  25% in 0.0030 secs
  50% in 0.0054 secs
  75% in 0.0085 secs
  90% in 0.0121 secs
  95% in 0.0147 secs
  99% in 0.0222 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0957 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0339 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0290 secs
  resp wait:	0.0054 secs, 0.0001 secs, 0.0390 secs
  resp read:	0.0007 secs, 0.0000 secs, 0.0488 secs

Status code distribution:
  [200]	100000 responses