tests/tproxy_benchmark.txt
// running thanos with round robin
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	47.2366 secs
  Slowest:	0.1536 secs
  Fastest:	0.0001 secs
  Average:	0.0047 secs
  Requests/sec:	21170.0229
  
  Total data:	12000000 bytes
  Size/request:	12 bytes

Response time histogram:
  0.000 [1]	|
  0.015 [988430]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.031 [9861]	|
  0.046 [1151]	|
  0.061 [296]	|
  0.077 [160]	|
  0.092 [25]	|
  0.108 [34]	|
  0.123 [5]	|
  0.138 [0]	|
  0.154 [37]	|


Latency distribution:
  10% in 0.0010 secs
  25% in 0.0022 secs
  50% in 0.0041 secs
  75% in 0.0063 secs
  90% in 0.0087 secs
  95% in 0.0106 secs
  99% in 0.0161 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.1536 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0101 secs
  req write:	0.0000 secs, 0.0000 secs, 0.1120 secs
  resp wait:	0.0043 secs, 0.0000 secs, 0.1535 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.1116 secs

Status code distribution:
  [200]	1000000 responses

// running thanos with least connections
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	45.1085 secs
  Slowest:	0.0603 secs
  Fastest:	0.0001 secs
  Average:	0.0045 secs
  Requests/sec:	22168.7491
  
  Total data:	11000000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.006 [782107]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [201381]	|■■■■■■■■■■
  0.018 [12670]	|■
  0.024 [2764]	|
  0.030 [724]	|
  0.036 [218]	|
  0.042 [57]	|
  0.048 [36]	|
  0.054 [40]	|
  0.060 [2]	|


Latency distribution:
  10% in 0.0014 secs
  25% in 0.0027 secs
  50% in 0.0040 secs
  75% in 0.0058 secs
  90% in 0.0079 secs
  95% in 0.0094 secs
  99% in 0.0137 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0603 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0167 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0287 secs
  resp wait:	0.0042 secs, 0.0000 secs, 0.0441 secs
  resp read:	0.0002 secs, 0.0000 secs, 0.0291 secs

Status code distribution:
  [200]	1000000 responses