tests/tproxy_benchmark.txt
// running 3 node servers
hey -n 1000000 -c 100 http://localhost:9000

Summary:
  Total:	48.8287 secs
  Slowest:	0.1008 secs
  Fastest:	0.0001 secs
  Average:	0.0049 secs
  Requests/sec:	20479.7568
  
  Total data:	11000000 bytes
  Size/request:	11 bytes

Response time histogram:
  0.000 [1]	|
  0.010 [937521]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.020 [58260]	|■■
  0.030 [3129]	|
  0.040 [660]	|
  0.050 [133]	|
  0.061 [94]	|
  0.071 [48]	|
  0.081 [95]	|
  0.091 [34]	|
  0.101 [25]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0025 secs
  50% in 0.0043 secs
  75% in 0.0065 secs
  90% in 0.0089 secs
  95% in 0.0108 secs
  99% in 0.0162 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.1008 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0078 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0639 secs
  resp wait:	0.0044 secs, 0.0000 secs, 0.1008 secs
  resp read:	0.0003 secs, 0.0000 secs, 0.0766 secs

Status code distribution:
  [200]	1000000 responses